app/controllers/predictions_controller.rb

  def index
    @predictions = Prediction.all
---
SELECT "predictions".* FROM "predictions"

  def create
  	@ticker = params[:ticker]
    if (Prediction.exists?(ticker: @ticker))
      @prediction = Prediction.find_by ticker: @ticker
      redirect_to prediction_path(@prediction)
    else
      result = %x[ipython alltogether.py #{@ticker}]
      arr = result.split("\n")
      arr = arr[arr.length-2]
      if (arr[0] == "[" and arr[arr.length-1] == "]")
       # byebug
        @output = YAML.load(arr)
        @model = @output[0]
        @confidence = @output[1].to_f
        @result = @output[2]
        @prediction = Prediction.new(ticker: @ticker, model: @model, confidence: @confidence, result: @result)
        @prediction.save
---
SELECT  "predictions".* FROM "predictions" WHERE "predictions"."ticker" = ? LIMIT ?  [["ticker", "AMZN"], ["LIMIT", 1]]
SELECT  1 AS one FROM "predictions" WHERE "predictions"."ticker" = ? LIMIT ?  [["ticker", "AAPL"], ["LIMIT", 1]]
INSERT INTO "predictions" ("ticker", "model", "confidence", "result", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["ticker", "AAPL"], ["model", "tree model"], ["confidence", 0.5692771084337349], ["result", 1], ["created_at", "2018-05-11 04:42:34.686269"], ["updated_at", "2018-05-11 04:42:34.686269"]]

  def destroy
    @prediction.destroy
---
DELETE FROM "predictions" WHERE "predictions"."id" = ?  [["id", 10]]

  def prediction_id
    @prediction = Prediction.find(params[:id])
---
SELECT  "predictions".* FROM "predictions" WHERE "predictions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]