app/controllers/predictions_controller.rb

  def prediction_id
    @prediction = Prediction.find(params[:id])
---
SELECT  "predictions".* FROM "predictions" WHERE "predictions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]